## "Число Фибоначчи"

### Задание

По данному числу n определите n-е [число Фибоначчи](https://ru.wikipedia.org/wiki/%D0%A7%D0%B8%D1%81%D0%BB%D0%B0_%D0%A4%D0%B8%D0%B1%D0%BE%D0%BD%D0%B0%D1%87%D1%87%D0%B8).

### Формат входных данных

Дано целое положительное число n, номер числа Фибоначчи в последовательности.

### Формат выходных данных

Вывести число Фибоначчи с номером n.


### Решение задачи

```python
n = int(input())

c1 = 0
c2 = 1
c3 = 1

if n == 1:
    print(c1)
elif n == 2 or n == 3:
    print(c2)
else:
    n -= 3
    while n > 0:
        c3 += c2
        c2 += c1
        c1 = c2 - c1
        n -= 1
    print(c3)

```

### Данные для самопроверки

| Дано | Результат |
| :---: | --- |
|    1    | 0 |
|    4    | 2 |
|    7    | 8  |
|    11    | 55 |
